In [1]:
import pandas as pd

In [4]:
filepath = './datasets/daily-min-temperatures.csv'

In [12]:
temp = pd.read_csv(filepath)

In [13]:
temp.head()

         Date  Temp
0  1981-01-01  20.7
1  1981-01-02  17.9
2  1981-01-03  18.8
3  1981-01-04  14.6
4  1981-01-05  15.8

In [15]:
temp.index

RangeIndex(start=0, stop=3650, step=1)

In [50]:
# squeeze as read_csv is deprecated
# temp = pd.read_csv(filepath, header=0, index_col=0,
#                    parse_dates=True, squeeze=True)

temp = pd.read_csv(filepath, header=0, index_col=0,
                   parse_dates=True).squeeze()

In [51]:
temp.head()

Date
1981-01-01    20.7
1981-01-02    17.9
1981-01-03    18.8
1981-01-04    14.6
1981-01-05    15.8
Name: Temp, dtype: float64

In [52]:
temp.index

DatetimeIndex(['1981-01-01', '1981-01-02', '1981-01-03', '1981-01-04',
               '1981-01-05', '1981-01-06', '1981-01-07', '1981-01-08',
               '1981-01-09', '1981-01-10',
               ...
               '1990-12-22', '1990-12-23', '1990-12-24', '1990-12-25',
               '1990-12-26', '1990-12-27', '1990-12-28', '1990-12-29',
               '1990-12-30', '1990-12-31'],
              dtype='datetime64[ns]', name='Date', length=3650, freq=None)

In [53]:
type(temp)

pandas.core.series.Series

In [54]:
df = pd.DataFrame(temp).reset_index().rename(
    columns={'Temp': 'temperature'})  # empty df
# df['month'] = [temp.index[i].month for i in range(len(temp.index))]
# df['day'] = [temp.index[i].day for i in range(len(temp.index))]
# df['month'] = [temp[i].month for i in range(len(temp.index))]
df.head()

        Date  temperature
0 1981-01-01         20.7
1 1981-01-02         17.9
2 1981-01-03         18.8
3 1981-01-04         14.6
4 1981-01-05         15.8

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3650 entries, 0 to 3649
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         3650 non-null   datetime64[ns]
 1   temperature  3650 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 57.2 KB

In [57]:
df['month'] = df.Date.dt.month
df['day'] = df.Date.dt.day

In [58]:
df.head()

        Date  temperature  month  day
0 1981-01-01         20.7      1    1
1 1981-01-02         17.9      1    2
2 1981-01-03         18.8      1    3
3 1981-01-04         14.6      1    4
4 1981-01-05         15.8      1    5

In [59]:
df = df[['month', 'day', 'temperature']]

In [60]:
df.head()

   month  day  temperature
0      1    1         20.7
1      1    2         17.9
2      1    3         18.8
3      1    4         14.6
4      1    5         15.8